tap "anomalyco/tap", "https://github.com/anomalyco/homebrew-tap.git"
tap "arl/arl"
tap "atlassian/acli"
tap "boz/repo"
tap "browsh-org/browsh"
tap "charmbracelet/tap"
tap "comcast/opensource"
tap "creativeprojects/tap"
tap "etopeter/tap"
tap "github/gh"
tap "graalvm/tap"
tap "grafana/grafana"
tap "hashicorp/tap"
tap "jason0x43/neovim-nightly"
tap "k0sproject/tap"
tap "mat2cc/tap"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "opencode-ai/tap"
tap "qnkhuat/tap"
tap "ramonvermeulen/whosthere"
tap "rootlyhq/tap"
tap "steinbrueckri/packages"
tap "txn2/tap"
tap "updatecli/updatecli"
tap "vitobotta/tap"
tap "warrensbox/tap"
tap "xo/xo"
tap "y3owk1n/tap"
tap "zdcthomas/tools"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Validating, recursive, caching DNS resolver
brew "unbound"
# General-purpose data compression with high compression ratio
brew "xz"
# Email client that runs in your terminal
brew "aerc"
# Simple, modern, secure file encryption
brew "age"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# OpenType text shaping engine
brew "harfbuzz"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generic online banking interface
brew "aqbanking"
# Portable library for network traffic capture
brew "libpcap"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Shell extension to jump to frequently used directories
brew "autojump"
# Fast, efficient and secure backup program
brew "restic"
# High level CLI utility for restic
brew "autorestic"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Modular SIP useragent
brew "baresip"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash Automated Testing System
brew "bats-core"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Interface bandwidth monitor
brew "bmon"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Translates human-readable Butane Configs into machine-readable Ignition Configs
brew "butane"
# CloudFlare's PKI toolkit
brew "cfssl"
# Framework for layout and rendering of i18n text
brew "pango"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# TUI web browser with CSS, inline image and JavaScript support
brew "chawan"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# Cross-platform make
brew "cmake"
# Securely send things from one computer to another
brew "croc"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl", link: true
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line tool for DigitalOcean
brew "doctl"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# CLI utility to build and manage a PKI CA
brew "easy-rsa"
# General purpose Language Server
brew "efm-langserver"
# Easily install prebuilt binaries from GitHub
brew "eget"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Run arbitrary commands when files change
brew "entr"
# Multi-threaded file-tree visualizer and disk usage analyzer
brew "erdtree"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Text mode browser and Gemini, NNTP, FTP, Gopher, Finger, and BitTorrent client
brew "felinks"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# HTTP and gRPC load testing and visualization tool and server
brew "fortio"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Automatic updates of GeoIP2 and GeoIP Legacy databases
brew "geoipupdate"
# GitHub command-line tool
brew "gh"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Remote repository management made easy
brew "ghq"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Distributed, offline-first bug tracker embedded in git, with bridges
brew "git-bug"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Git blame for file trees
brew "git-who"
# Audit git repos for secrets
brew "gitleaks"
# Watch a file or folder and automatically commit changes to a git repo easily
brew "gitwatch"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Fast linters runner for Go
brew "golangci-lint"
# Log analysis TUI
brew "gonzo"
# Slightly more awesome Standard Unix Password Manager for Teams
brew "gopass"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Manage your GnuPG keys with ease!
brew "gpg-tui"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Tool for glamorous shell scripts
brew "gum"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# CLI email client written in Rust
brew "himalaya"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Matrix client for Vim addicts
brew "iamb"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tool to set default openers for file formats and url schemes on macOS
brew "infat"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Istio configuration command-line utility
brew "istioctl"
# Manage your Java environment
brew "jenv"
# Json incremental digger
brew "jid"
# Git-compatible distributed version control system
brew "jj"
# Command-line pager for JSON data
brew "jless"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# TUI playground to experiment and play with jq
brew "jqp"
# Handy way to save and run project-specific commands
brew "just"
# Console carddav client
brew "khard"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# TUI for logs from journalctl, file system, Docker, Podman and Kubernetes pods
brew "lazyjournal"
# Asynchronous event library
brew "libev"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Fast, async, resource-friendly link checker
brew "lychee"
# Text-based web browser
brew "lynx"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# Command-line based markdown presentation tool
brew "mdp"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Deep clean and optimize your Mac
brew "mole"
# Remote terminal application
brew "mosh"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ncurses UI for QEMU
brew "nemu"
# No Nonsense Neovim Client in Rust
brew "neovide"
# TUI log viewer with timeline histogram and no central server
brew "nerdlog"
# Utility for managing network connections
brew "netcat"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# HTTP/2 C Library
brew "nghttp2"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# HTTP/DNS scanner configurable via YAML templates
brew "nuclei"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Simplistic interactive filtering tool
brew "peco"
# Minimal dumb-terminal emulation program
brew "picocom"
# Prometheus rule linter/validator
brew "pint"
# Paste PNG into files
brew "pngpaste"
# Tool for managing OCI containers and pods
brew "podman"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@15"
# Terminal slideshow tool
brew "presenterm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Service monitoring system and time series database
brew "prometheus"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Command-line interface for Render
brew "render"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Rust toolchain installer
brew "rustup"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Smart session manager for the terminal
brew "sesh"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Create beautiful image of your source code
brew "silicon"
# Advanced console-based IP subnet calculator
brew "sipcalc"
# Drop-in replacement for Nmap powered by shodan.io
brew "smap"
# Automate your tmux workflow
brew "smug"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Editor of encrypted files
brew "sops"
# Package manager that builds multiple versions and configurations of software
brew "spack"
# This tool is a command-line client for the SSL Labs APIs
brew "ssllabs-scan"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Cross-shell prompt for astronauts
brew "starship"
# Minimal, customizable and neofetch-like weather CLI based on rainy
brew "stormy"
# Version control system designed to be a better CVS
brew "subversion"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# SMTP command-line test tool
brew "swaks"
# General purpose fuzzy finder TUI
brew "television"
# User interface to the TELNET protocol
brew "telnet"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Ultimate terminal divider powered by tmux
brew "tmux-xpanes"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Upgrade all the things
brew "topgrade"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Realtime plotting utility for terminal with data input from stdin
brew "ttyplot"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Maintained ctags implementation
brew "universal-ctags"
# Syntax-aware linter for prose
brew "vale"
# Synchronize calendars and contacts
brew "vdirsyncer"
# Your CLI home video recorder
brew "vhs"
# Modern watch command
brew "viddy"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Simple terminal image viewer written in Rust
brew "viu"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid", link: false
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Command-line client for WebSockets
brew "websocat"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Why is this running?
brew "witr"
# Personal information dashboard for your terminal
brew "wtfutil"
# Markdown defined task runner
brew "xc"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"
# Yet Another Dotfiles Manager
brew "yadm"
# Copy terminal output to clipboard
brew "yank"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# CLI to convert between YAML, TOML, JSON and HCL
brew "yj"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Menu bar icon organiser
cask "bartender"
# Online diagram software
cask "drawio"
# Cross-platform Text Expander written in Rust
cask "espanso"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-maple-mono-nf"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
# GIT client
cask "fork"
# Tools to protect your emails and files
cask "gpg-suite"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Free and open-source media player
cask "iina"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Open-source software for live streaming and screen recording
cask "obs"
# Visual client for Helix Core
cask "p4v"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Control your tools with a few keystrokes
cask "raycast"
# Terminal UI for Rootly incidents and alerts
cask "rootlyhq/tap/rootly-tui"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Real time file synchronisation software
cask "syncthing-app"
# Adaptive brightness for displays
cask "vivid-app"
# Native desktop client for WhatsApp
cask "whatsapp"
# Local network discovery tool with an interactive Terminal User Interface (TUI) written in Go.
cask "ramonvermeulen/whosthere/whosthere"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
go "github.com/ClickHouse/clickhouse_exporter"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/shinagawa-web/gomarklint"
go "golang.org/x/tools/gopls"
go "github.com/prometheus/promu"
go "github.com/mrusme/reader"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/tenox7/stc"
go "github.com/allaman/werkzeugkasten"
npm "@ansible/ansible-language-server"
npm "@sourcegraph/cody"
npm "@usebruno/cli"
npm "actual-moneymoney"
npm "corepack"
npm "cz-conventional-changelog"
npm "docsify-cli"
npm "git-cz"
npm "jsonresume-theme-papirus"
npm "markdownlint-cli2"
npm "percollate"
npm "resume-cli"
npm "snyk"
npm "stepci"
npm "tree-sitter-cli"
npm "vscode-langservers-extracted"
