tap "alajmo/mani"
tap "anchore/grype"
tap "aquasecurity/trivy"
tap "boz/repo"
tap "brandonskerritt/rustscan"
tap "charmbracelet/tap"
tap "comcast/opensource"
tap "denisidoro/tools"
tap "derailed/k9s"
tap "derailed/popeye"
tap "dopplerhq/cli"
tap "eddieantonio/eddieantonio"
tap "etopeter/tap"
tap "fairwindsops/tap"
tap "fluxcd/tap"
tap "gabrie30/utils"
tap "github/gh"
tap "go-task/tap"
tap "golangci/tap"
tap "goreleaser/tap"
tap "graalvm/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homeport/tap"
tap "hudochenkov/sshpass"
tap "instrumenta/instrumenta"
tap "jason0x43/neovim-nightly"
tap "jesseduffield/horcrux"
tap "jesseduffield/lazygit"
tap "kube-score/tap"
tap "liamg/tfsec"
tap "ms-jpq/sad"
tap "norwoodj/tap"
tap "planetscale/tap"
tap "qnkhuat/tap"
tap "saulpw/vd"
tap "shopify/shopify"
tap "spectralops/tap"
tap "superbrothers/zsh-kubectl-prompt"
tap "tclass/cloud_sql_proxy"
tap "tilt-dev/tap"
tap "turbot/tap"
tap "txn2/tap"
tap "warrensbox/tap"
tap "xo/xo"
tap "xwmx/taps"
brew "age"
brew "arp-scan"
brew "readline"
brew "asciinema"
brew "coreutils"
brew "asdf"
brew "b2-tools"
brew "bandwhich"
brew "bat"
brew "bats-core"
brew "openjdk"
brew "bfg"
brew "blueutil"
brew "icu4c"
brew "bottom"
brew "broot"
brew "gcc"
brew "btop"
brew "caddy"
brew "python@3.9"
brew "glib"
brew "gnutls"
brew "cask"
brew "chart-testing"
brew "checkov", link: false
brew "choose-rust"
brew "cmake"
brew "lima"
brew "colima"
brew "freetds"
brew "php"
brew "composer"
brew "container-structure-test", link: false
brew "croc"
brew "cypher-shell"
brew "dasel"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "doctl"
brew "dog"
brew "dos2unix"
brew "duf"
brew "dust"
brew "efm-langserver"
brew "erlang"
brew "elixir"
brew "entr"
brew "exa"
brew "exiftool"
brew "faas-cli"
brew "fd"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fluxctl"
brew "fortio"
brew "fping"
brew "freerdp"
brew "fx"
brew "fzf"
brew "gh"
brew "ghq"
brew "gist"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-secret"
brew "gitleaks"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "gopass"
brew "gpg-tui"
brew "gping"
brew "gradle"
brew "pango"
brew "graphviz"
brew "groovysdk"
brew "hadolint"
brew "helm"
brew "hey"
brew "hping"
brew "htmlq"
brew "htop"
brew "httpie"
brew "hugo"
brew "ical-buddy"
brew "libheif"
brew "imagemagick"
brew "ipfs"
brew "ipinfo"
brew "istioctl"
brew "jabba"
brew "jenv"
brew "jid"
brew "jless"
brew "jmeter"
brew "jo"
brew "jq"
brew "jruby"
brew "just"
brew "k3d"
brew "k9s"
brew "kind"
brew "kompose"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kubeseal"
brew "kubie"
brew "kustomize"
brew "kyverno"
brew "linkerd"
brew "lolcat"
brew "luarocks"
brew "m-cli"
brew "mackup"
brew "mas"
brew "maven"
brew "mdp"
brew "mosh"
brew "mtr"
brew "mysql-client"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "netlify-cli", link: false
brew "nmap"
brew "oauth2_proxy"
brew "octant"
brew "pandoc"
brew "parallel"
brew "pcp"
brew "peco"
brew "pngpaste"
brew "procs"
brew "pv"
brew "python@3.7"
brew "python@3.8"
brew "qt"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "ripgrep-all"
brew "rsync"
brew "rust"
brew "rustscan"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "sipcalc"
brew "sops"
brew "spack"
brew "stern"
brew "tealdeer"
brew "teleport"
brew "telnet"
brew "terraformer"
brew "terragrunt"
brew "testssl"
brew "tflint"
brew "tfsec"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmux-xpanes"
brew "tmuxinator"
brew "todo-txt"
brew "toilet"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "vault"
brew "vifm"
brew "viu"
brew "watch"
brew "watchman"
brew "wget"
brew "wimlib"
brew "wtfutil"
brew "yadm"
brew "yank"
brew "yarn"
brew "yj"
brew "youtube-dl"
brew "yq"
brew "alajmo/mani/mani"
brew "anchore/grype/grype"
brew "aquasecurity/trivy/trivy"
brew "boz/repo/kail"
brew "charmbracelet/tap/glow"
brew "comcast/opensource/snowdrift"
brew "denisidoro/tools/navi"
brew "derailed/popeye/popeye"
brew "dopplerhq/cli/doppler"
brew "eddieantonio/eddieantonio/imgcat"
brew "etopeter/tap/kubectl-view-utilization"
brew "fairwindsops/tap/nova"
brew "fluxcd/tap/flux"
brew "gabrie30/utils/ghorg"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform-ls"
brew "homeport/tap/dyff"
brew "hudochenkov/sshpass/sshpass"
brew "jesseduffield/horcrux/horcrux"
brew "jesseduffield/lazygit/lazygit"
brew "ms-jpq/sad/sad"
brew "planetscale/tap/pscale"
brew "qnkhuat/tap/termishare"
brew "shopify/shopify/toxiproxy"
brew "spectralops/tap/teller"
brew "superbrothers/zsh-kubectl-prompt/zsh-kubectl-prompt"
brew "turbot/tap/steampipe"
brew "txn2/tap/kubefwd"
brew "warrensbox/tap/tfswitch"
brew "xo/xo/usql"
brew "xwmx/taps/hosts"
brew "xwmx/taps/nb"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "basictex"
cask "boop"
cask "drawio"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "fork"
cask "gifox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hammerspoon"
cask "intellij-idea"
cask "karabiner-elements"
cask "keybase"
cask "keycastr"
cask "meetingbar"
cask "microsoft-teams"
cask "neovim-nightly"
cask "onedrive"
cask "paw"
cask "slack"
cask "swiftdefaultappsprefpane"
cask "tableplus"
cask "teamspeak-client"
cask "textexpander"
cask "visual-studio-code"
cask "wine-stable"
cask "wireshark"
cask "xca"
cask "xquartz"
mas "Dont Sleep", id: 466314666
mas "Drafts", id: 1435957248
mas "Grammarly for Safari", id: 1462114288
mas "Kanbanier", id: 1206854548
mas "KanbanView", id: 1507458952
mas "KyPass", id: 555293879
mas "Magnet", id: 441258766
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
mas "VMware Remote Console", id: 1230249825
