tap "alajmo/mani"
tap "anchore/grype"
tap "anchore/syft"
tap "aquasecurity/trivy"
tap "arl/arl"
tap "azhuchkov/tools"
tap "bjesus/pipet"
tap "boz/repo"
tap "brandonskerritt/rustscan"
tap "browsh-org/browsh"
tap "buildpacks/tap"
tap "caarlos0/tap"
tap "charmbracelet/tap"
tap "comcast/opensource"
tap "creativeprojects/tap"
tap "cyclonedx/cyclonedx"
tap "denisidoro/tools"
tap "derailed/k9s"
tap "derailed/popeye"
tap "dopplerhq/cli"
tap "eddieantonio/eddieantonio"
tap "emqx/mqttx"
tap "etopeter/tap"
tap "fairwindsops/tap"
tap "fluxcd/tap"
tap "gabrie30/utils"
tap "github/gh"
tap "go-task/tap"
tap "golangci/tap"
tap "goreleaser/tap"
tap "graalvm/tap"
tap "hashicorp/tap"
tap "hettysoft/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homeport/tap"
tap "jason0x43/neovim-nightly"
tap "jesseduffield/horcrux"
tap "jesseduffield/lazygit"
tap "jjuarez/tap-1"
tap "joerdav/xc"
tap "julien-cpsn/atac"
tap "k0sproject/tap"
tap "kardolus/chatgpt-cli"
tap "kube-score/tap"
tap "lucaspickering/tap"
tap "ms-jpq/sad"
tap "nakabonne/ali"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "norwoodj/tap"
tap "planetscale/tap"
tap "qnkhuat/tap"
tap "saulpw/vd"
tap "spectralops/tap"
tap "steinbrueckri/packages"
tap "stencilframe/autopilot"
tap "tilt-dev/tap"
tap "turbot/tap"
tap "txn2/tap"
tap "vitobotta/tap"
tap "warrensbox/tap"
tap "xo/xo"
tap "xwmx/taps"
tap "zdcthomas/tools"
brew "act"
brew "age"
brew "aichat"
brew "xz"
brew "openssl@3"
brew "libpcap"
brew "arp-scan"
brew "asciinema"
brew "asdf"
brew "aspell"
brew "atuin"
brew "autojump"
brew "restic"
brew "autorestic"
brew "awscli"
brew "b2-tools"
brew "bandwhich"
brew "node"
brew "bash-language-server"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "harfbuzz"
brew "icu4c@76"
brew "openjdk"
brew "bfg"
brew "blueutil"
brew "bmon"
brew "boring"
brew "bottom"
brew "broot"
brew "btop"
brew "cfssl"
brew "pango"
brew "chafa"
brew "choose-rust"
brew "cmake"
brew "curl"
brew "freetds"
brew "composer"
brew "croc"
brew "dasel"
brew "direnv"
brew "dive"
brew "docker-compose"
brew "doctl"
brew "dos2unix"
brew "duf"
brew "dust"
brew "easy-rsa"
brew "efm-langserver"
brew "eget"
brew "erlang"
brew "elixir"
brew "entr"
brew "erdtree"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "unbound"
brew "gnutls"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "fish"
brew "fortio"
brew "fping"
brew "fx"
brew "fzf"
brew "fzy"
brew "gcc"
brew "geoipupdate"
brew "gh"
brew "ghq"
brew "gist"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "git-lfs"
brew "git-who"
brew "gitleaks"
brew "gitwatch"
brew "gnu-sed"
brew "gnu-tar"
brew "qt"
brew "gnuplot"
brew "go"
brew "golangci-lint"
brew "gopass"
brew "goreleaser"
brew "gpg-tui"
brew "gping"
brew "graphviz"
brew "gron"
brew "gum"
brew "hadolint"
brew "hcloud"
brew "helix"
brew "helm"
brew "hey"
brew "himalaya"
brew "htmlq"
brew "htop"
brew "httpie"
brew "hugo"
brew "hurl"
brew "libheif"
brew "imagemagick"
brew "infat"
brew "ipinfo-cli"
brew "istioctl"
brew "jenv"
brew "jid"
brew "jless"
brew "jo"
brew "jq"
brew "just"
brew "k9s"
brew "kompose"
brew "lazydocker"
brew "pkgconf"
brew "libev"
brew "lolcat"
brew "luajit"
brew "luarocks"
brew "lychee"
brew "m-cli"
brew "mas"
brew "mdp"
brew "miller"
brew "minikube"
brew "mkcert"
brew "mosh"
brew "mtr"
brew "neonctl"
brew "neovide"
brew "netcat"
brew "newsboat"
brew "nghttp2"
brew "ngrep"
brew "nmap"
brew "nss"
brew "nuclei"
brew "pandoc"
brew "parallel"
brew "pcp"
brew "peco"
brew "pgcli"
brew "picocom"
brew "pint"
brew "pngpaste"
brew "poppler"
brew "postgresql@15"
brew "presenterm"
brew "prettier"
brew "procs"
brew "prometheus"
brew "pv"
brew "pwgen"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "ripgrep-all"
brew "rlwrap"
brew "rsync"
brew "ruby"
brew "rustup"
brew "s3cmd"
brew "scc"
brew "shellcheck"
brew "shfmt"
brew "silicon"
brew "sipcalc"
brew "smug"
brew "sonar-scanner"
brew "spack"
brew "ssllabs-scan"
brew "sslscan"
brew "starship"
brew "subversion"
brew "superfile"
brew "syft"
brew "television"
brew "telnet"
brew "testssl"
brew "tflint"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmux-xpanes"
brew "tmuxp"
brew "toilet"
brew "trash", link: true
brew "tree"
brew "trippy"
brew "ttyplot"
brew "unar"
brew "universal-ctags"
brew "vale"
brew "viddy"
brew "vifm"
brew "viu"
brew "vivid"
brew "w3m"
brew "watch"
brew "watchexec"
brew "websocat"
brew "wget"
brew "wimlib"
brew "wireguard-tools"
brew "wtfutil"
brew "xc"
brew "yadm"
brew "yank"
brew "yazi"
brew "yj"
brew "ykman"
brew "yq"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "azhuchkov/tools/tunblkctl"
brew "bjesus/pipet/pipet"
brew "browsh-org/browsh/browsh"
brew "buildpacks/tap/pack"
brew "caarlos0/tap/svu"
brew "charmbracelet/tap/glow"
brew "comcast/opensource/snowdrift"
brew "creativeprojects/tap/resticprofile"
brew "cyclonedx/cyclonedx/cyclonedx-cli"
brew "denisidoro/tools/navi"
brew "eddieantonio/eddieantonio/imgcat"
brew "emqx/mqttx/mqttx-cli"
brew "fairwindsops/tap/nova"
brew "fluxcd/tap/flux"
brew "gabrie30/utils/ghorg"
brew "go-task/tap/go-task"
brew "hashicorp/tap/consul"
brew "hettysoft/tap/hetty"
brew "homeport/tap/dyff"
brew "jesseduffield/horcrux/horcrux"
brew "jesseduffield/lazygit/lazygit"
brew "julien-cpsn/atac/atac"
brew "kardolus/chatgpt-cli/chatgpt-cli"
brew "lucaspickering/tap/slumber"
brew "ms-jpq/sad/sad"
brew "noahgorstein/tap/jqp"
brew "steinbrueckri/packages/input-source-selector"
brew "steinbrueckri/packages/pik"
brew "steinbrueckri/packages/sidecarlauncher"
brew "steinbrueckri/packages/themr", args: ["HEAD"]
brew "stencilframe/autopilot/autopilot"
brew "turbot/tap/steampipe"
brew "xo/xo/usql"
brew "xwmx/taps/hosts"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "anytype"
cask "boop"
cask "bruno"
cask "drawio"
cask "elgato-stream-deck"
cask "firefox"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "fork"
cask "ghostty"
cask "gitbutler"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "iina"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "mactex"
cask "obs"
cask "phoenix"
cask "prusaslicer"
cask "qmk-toolbox"
cask "rectangle"
cask "redis-insight"
cask "shortcat"
cask "skim"
cask "syncthing"
cask "wireshark"
cask "xca"
cask "xquartz"
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
